In [19]:
import pandas as pd 
import numpy as np

In [20]:
df = pd.read_json('F://Data_Set/json_file.json')

In [21]:
df

                                            contents
0  {'category': 'Furniture', 'region': 'West', 'm...
1  {'category': 'Technology', 'region': 'West', '...

In [7]:
#df = pd.read_json('F://Data_Set/sample-json-file.json')

In [22]:
df1 = pd.read_json('F://Data_Set/Sample_JSON_1.json')

In [33]:
df1

                                               users
0  {'userId': 1, 'firstName': 'Krish', 'lastName'...
1  {'userId': 2, 'firstName': 'racks', 'lastName'...
2  {'userId': 3, 'firstName': 'denial', 'lastName...
3  {'userId': 4, 'firstName': 'devid', 'lastName'...
4  {'userId': 5, 'firstName': 'jone', 'lastName':...

In [34]:
dataframe1 = pd.read_csv('F://Data_Set/Salaries1.csv')

In [35]:
dataframe1

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [36]:
#df2 = dataframe1.to_json(dataframe1)

#### Reading Excel file

In [38]:
dataset_1 = pd.read_excel('F://Data_Set/datavalmatchingitems.xlsx')

In [40]:
dataset_1.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,NaN,NaN,NaN,NaN,"Get weekly Excel tips, tutorials, videos, and ..."
1,NaN,NaN,NaN,NaN,Contextures Excel Newsletter
2,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,Instruction Page,NaN,NaN
4,NaN,NaN,List Matching Items for Selection,NaN,NaN

#### Picking

In [41]:
dataset_1.to_pickle('dataset_1')

In [42]:
df3 = pd.read_pickle('dataset_1')

In [44]:
df3.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,NaN,NaN,NaN,NaN,"Get weekly Excel tips, tutorials, videos, and ..."
1,NaN,NaN,NaN,NaN,Contextures Excel Newsletter
2,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,Instruction Page,NaN,NaN
4,NaN,NaN,List Matching Items for Selection,NaN,NaN